<?php

namespace Parsisolution\Gateway\Providers\Bahamta;

use Parsisolution\Gateway\Exceptions\TransactionException;

class BahamtaException extends TransactionException
{

    /**
     * returns an associative array of `code` => `message`
     *
     * @return array
     */
    protected function getErrors()
    {
        return [
            'INVALID_API_CALL'      => 'قالب فراخوانی سرویس رعایت نشده است. مثلاً ممکن است پارامترها به درستی از هم جدا نشده باشند و یا حروف غیر مجاز (مثل فاصله) در بین آنها وجود داشته باشد. برای تبدیل حروف غیرمجاز لازم است که مقادیر url encode شده باشند.',
            'INVALID_API_KEY'       => 'کلید الکترونیکی صاحب فروشگاه فرستاده نشده و یا ساختار آن نادرست است.',
            'NOT_AUTHORIZED'        => 'گرچه ساختار کلید درست است، اما هیچ فروشنده‌ای با این کلید در webpay ثبت نشده است.',
            'INVALID_AMOUNT'        => 'پارامتر مبلغ فرستاده نشده و یا نادرست فرستاده شده است. مثلاً ممکن است ارقام مبلغ سه رقم به سه رقم با علامت , جدا شده باشند که نادرست است.',
            'LESS_THAN_WAGE_AMOUNT' => 'مبلغ کمتر از کارمزد پرداختی است.',
            'TOO_LESS_AMOUNT'       => 'مبلغ کمتر از حد مجاز (هزار تومان) است.',
            'TOO_MUCH_AMOUNT'       => 'مبلغ بیشتر از حد مجاز (پنجاه میلیون تومان) است.',
            'INVALID_REFERENCE'     => 'شماره شناسه پرداخت ناردست است. این مقدار باید یک عبارت حرفی با طول بین ۱ تا ۶۴ حرف باشد.',
            'INVALID_TRUSTED_PAN'   => 'لیست شماره کارتها نادرست است. هر شماره کارت باید با یک علامت کاما از شماره کارت قبلی خود جدا شده باشد. طول هر شماره کارت باید ۱۶ رقم باشد، و اگر ۶ رقم دوم آن مخفی است، به جای هر یک از رقمهای مخفی باید یک علامت ستاره گذاشته شده باشد.',
            'INVALID_CALLBACK'      => 'آدرس فراخوانی نادرست است. این آدرس باید با ://http و یا ://https شروع شود.',
            'INVALID_PARAM'         => 'خطایی در مقادیر فرستاده شده وجود دارد که جزو موارد یاد شده بالا نیست.',
            'ALREADY_PAID'          => 'درخواست پرداختی با شناسه داده شده قبلاً ثبت و پرداخت شده است. شناسه reference تکراری است و باید برای هر درخواست متفاوت باشد. توجه به این نکته می‌تواند مفید باشد که تکراری بودن شناسه مرجع می‌تواند به دو دلیل رخ دهد: ۱- سایت فروشگاه به اشتباه یک شناسه را برای دو سفارش جداگانه استفاده کرده باشد. که در این صورت این خطا باید در سایت فروشگاه برطرف شود. ۲- ممکن است برای یک سفارش واحد، دو بار درخواست فرستاده شده باشد. در این صورت می‌توان برای دریافت تأیید اقدام کرد و نتیجه پرداخت را به طور مستقم از webpay جویا شد.',
//            'MISMATCHED_DATA'       => 'درخواست پرداختی با شناسه داده شده قبلاً ثبت و منتظر پرداخت است، اما مقادیر فرستاده شده در این درخواست، با درخواست اصلی متفاوت است. از آنجا که ممکن است به هر دلیلی، از جمله قطع اینترنت، نتیجه درخواست به دست فرستنده نرسد این امکان وجود دارد که یک درخواست دوباره (و با همان شناسه) فرستاده شود تا نتیجه درخواست به دست فرستنده برسد. اما در چنین حالتی مقادیر اصلی درخواست از جمله مبلغ و کارت‌های بانکی مورد اعتماد باید با مقادیر قبلی یکسان باشند، در غیر این صورت، درخواست با این خطا روبرو خواهد شد.',
            'NO_REG_TERMINAL'       => 'ترمینالی برای این فروشنده ثبت نشده است.',
            'NO_AVAILABLE_GATEWAY'  => 'درگاههای پرداختی که این فروشنده در آنها ترمینال ثبت شده دارد، قادر به ارائه خدمات نیستند.',
            'UNKNOWN_BILL'          => 'پرداختی با شماره شناسه فرستاده شده ثبت نشده است.',
            'MISMATCHED_DATA'       => 'مبلغ اعلام شده با آنچه در webpay ثبت شده است مطابقت ندارد.',
            'NOT_CONFIRMED'         => 'این پرداخت تأیید نشد.',
            'SERVICE_ERROR'         => 'خطای داخلی سرویس رخ داده است.',
            'UNKNOWN_ERROR'         => 'خطای نامشخص رخ داده است.',
        ];
    }
}
