<?php

namespace Parsisolution\Gateway\Providers\Sizpay;

use Parsisolution\Gateway\Exceptions\TransactionException;

class SizpayException extends TransactionException
{
    /**
     * returns an associative array of `code` => `message`
     *
     * @return array
     */
    protected function getErrors()
    {
        return [
            0   => 'موفق',
            106 => 'مبلغ پرداختی باید بین 10,000 و 50,000,000 ریال باشد.',
            128 => 'نام کاربری و یا رمزعبور نامعتبر می باشد.',

            1000 => 'خطای داخلی رخ داده است لطفا درخواست را دوباره ارسال کنید.',
            1001 => 'کد پذیرنده باید به صورت رشته عددی و حداکثر 15 کاراکتر باشد',
            1002 => 'کد ترمینال باید به صورت رشته عددی و صرفا 8 کاراکتر باشد',
            1003 => 'پذیرنده و یا ترمینال معتبر نمی باشد.',
            1004 => 'نوع ترمینال معتبر نمی باشد',
            1005 => 'فرمت مبلغ قابل پرداخت نادرست است',
            1006 => 'مبلغ پرداختی باید بین {0} و {1} ریال باشد',
            1007 => 'تاریخ سند صحیح نمی باشد.',
            1008 => 'آدرس بازگشت نمیتواند خالی باشد',
            1009 => 'آدرس بازگشت باید با http// ویا https// شروع شود.',
            1010 => 'درخواست تراکنش صحیح IP نیست(در لیست اعلامی پذیرنده موجود نیست)',
            1011 => 'درگاه پرداخت فعالی برای این پذیرنده و ترمینال وجود ندارد',
            1012 => 'خطا در اتصال به درگاه پرداخت',
            1013 => 'خطا در دریافت اطلاعات از درگاه پرداخت',
            1014 => 'کلید ترمینال صحیح نمی باشد',
            1015 => 'ورود همه موارد اجباری می باشد.',
            1016 => 'مقادیر ورودی نامعتبر می باشد',
            1017 => 'خطا در دریافت اطلاعات پذیرنده',
            1018 => 'انصراف از پرداخت',
            1019 => 'توکن نامعتبر می باشد',
            1020 => 'توکن منقضی شده است',
            1021 => 'تراکنش یافت نشد',
            1022 => 'تراکنش مربوط به این پذیرنده و ترمینال نمی باشد و یا تراکنش نامعتبر می باشد',
            1023 => 'تراکنش قبلا برگشت شده است و نمی توان آن را تایید کرد.',
            1024 => 'تراکنش قبلا تایید شده است',
            1025 => 'تراکنش قبلا تایید شده است و نمی توان آن را برگشت کرد',
            1026 => 'تراکنش قبلا برگشت شده است',
            1027 => 'شناسه پرداخت نامعتبر می باشد. شناسه پرداخت باید رشته ای فقط عددی باشد',
            1028 => 'نام کاربری و یا رمزعبور نامعتبر می باشد.',
            1029 => 'لطفا مقادیر تایید هویت را به درستی وارد نمایید.',
            1030 => 'این عملیات برای توکن مورد نظر نامعتبر می باشد.',
            1031 => 'تاریخ سند نمی تواند بعد از تاربخ امروز باشد',
            1032 => 'از تاریخ سند نمیتواند بیشتر از {0} روز گذشته باشد',
            1033 => 'شناسه خرید نامعتبر می باشد',
            9999 => 'نامشخص',
        ];
    }
}
