<?php

namespace Parsisolution\Gateway\Providers\Milyoona;

use Parsisolution\Gateway\Exceptions\TransactionException;

class MilyoonaException extends TransactionException
{
    /**
     * returns an associative array of `code` => `message`
     *
     * @return array
     */
    protected function getErrors()
    {
        return [
            'NOK' => 'عملیات پرداخت ناموفق بوده',

            0   => 'عملیات با موفقیت انجام شد',
            1   => 'تراکنش ناموفق',
            2   => 'مبلغ تراکنش مجاز نیست',
            3   => 'عدم تطابق شماره کارت با پرداخت کننده',
            4   => 'تراکنش استفاده شده',
            5   => 'تراکنش  یکبار تائید شده است',
            6   => 'ترمیال مسدود است',
            10  => 'از انجام تراکنش صرف نظر شد',
            11  => 'پذیرنده نامعتبر است',
            24  => 'عدم تطابق کد ملی خریدار با دارنده کارت',
            25  => 'توکن معتبر نمی باشد',
            26  => 'انجام تراکنش با یک کارت خاص از طرف پذیرنده محدود شده است',
            27  => 'ترمینال غیر فعال است',
            28  => 'آیپی معتبر نمی باشد',
            29  => 'مهلت تایید تراکنش به اتمام رسیده است',
            30  => 'مهلت استفاده از کد تخفیف به اتمام رسیده است',
            31  => 'محصول مورد نظر شما به اتمام رسیده است',
            400 => 'خطا در اطلاعات ارسالی',
            500 => 'خطای داخلی سرور',
        ];
    }
}
