<?php

namespace Parsisolution\Gateway\Providers\IDPay;

use Parsisolution\Gateway\Exceptions\TransactionException;

class IDPayException extends TransactionException
{
    /**
     * returns an associative array of `code` => `message`
     *
     * @return array
     */
    protected function getErrors()
    {
        return [
            -1 => 'خطای غیر منتظره',
            11 => 'کاربر مسدود شده است.',
            12 => 'API Key یافت نشد.',
            13 => 'درخواست شما از {ip} ارسال شده است. این IP با IP های ثبت شده در وب سرویس همخوانی ندارد.',
            14 => 'وب سرویس شما در حال بررسی است و یا تایید نشده است.',
            15 => 'سرویس مورد نظر در دسترس نمی باشد.',
            21 => 'حساب بانکی متصل به وب سرویس تایید نشده است.',
            22 => 'وب سریس یافت نشد.',
            23 => 'اعتبار سنجی وب سرویس ناموفق بود.',
            24 => 'حساب بانکی مرتبط با این وب سرویس غیر فعال شده است.',
            31 => 'کد تراکنش id نباید خالی باشد.',
            32 => 'شماره سفارش order_id نباید خالی باشد.',
            33 => 'مبلغ amount نباید خالی باشد.',
            34 => 'مبلغ amount باید بیشتر از {min-amount} ریال باشد.',
            35 => 'مبلغ amount باید کمتر از {max-amount} ریال باشد.',
            36 => 'مبلغ amount بیشتر از حد مجاز است.',
            37 => 'آدرس بازگشت callback نباید خالی باشد.',
            38 => 'درخواست شما از آدرس {domain} ارسال شده است. دامنه آدرس بازگشت callback با آدرس ثبت شده در وب سرویس همخوانی ندارد.',
            39 => 'آدرس بازگشت callback نامعتبر است.',
            41 => 'فیلتر وضعیت تراکنش ها می بایست آرایه ای (لیستی) از وضعیت های مجاز در مستندات باشد.',
            42 => 'فیلتر تاریخ پرداخت می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.',
            43 => 'فیلتر تاریخ تسویه می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.',
            44 => 'فیلتر تراکنش صحیح نمی باشد.',
            51 => 'تراکنش ایجاد نشد.',
            52 => 'استعلام نتیجه ای نداشت.',
            53 => 'تایید پرداخت امکان پذیر نیست.',
            54 => 'مدت زمان تایید پرداخت سپری شده است.',
        ];
    }
}
